# GetDistributionPath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDrivenAccessor..::..GetDistributionPath Method
RebarShapeDrivenAccessor Class See Also
---
The distribution path of a rebar set.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Line GetDistributionPath()
```

Visual Basic
---
```text
Public Function GetDistributionPath As Line
```

Visual C++
---
```text
public:
Line^ GetDistributionPath()
```

# ### Return Value
A line beginning at (0, 0, 0) and representing the direction and length of the set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

# See Also
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace